//	01.00.01	31.03.2026 Переделка банковского платежа на кассовый

Перем Версия Экспорт;     
Процедура КнопкаИмпортаКлац()  Экспорт
	ИмпортИзExcel();          
КонецПроцедуры
Процедура КнопкаВыравнятьКлац() Экспорт
	ПровестиОплаты();
КонецПроцедуры
Процедура ИмпортИзExcel()
	ТЧДанные.Очистить();
    // Выбор файла
    Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
    Диалог.ПолноеИмяФайла = "";
    Диалог.Фильтр = "Excel files (*.xlsx)|*.xlsx";
    Диалог.Заголовок = "Выберите Excel-файл для импорта";

    Если Не Диалог.Выбрать() Тогда
        Возврат;
    КонецЕсли;

    ПутьКФайлу = Диалог.ПолноеИмяФайла;

    Excel = Новый COMОбъект("Excel.Application");
    Excel.Visible = Ложь;

    Книга = Excel.Workbooks.Open(ПутьКФайлу);
    Лист = Книга.Worksheets(1);

    ТекущаяСтрока = 2; // пропускаем заголовок
	ДатаРасчета=Неопределено;
	Операция="";       
	КодКассы="";
    Пока Истина Цикл
        Если ПустаяСтрока(Лист.Cells(ТекущаяСтрока, 2).Value) Тогда
            Прервать;
		КонецЕсли;  
		Если ДатаРасчета=Неопределено Тогда
			ДатаРасчета=Лист.Cells(ТекущаяСтрока, 1).Value;
		КонецЕсли;
        НоваяСтрока = ТЧДанные.Добавить();
//		НоваяСтрока.Дата              = Лист.Cells(ТекущаяСтрока, 1).Value;
        НоваяСтрока.ИНН		          = Лист.Cells(ТекущаяСтрока, 2).Value;   
		НоваяСтрока.КлиентVbit        = Лист.Cells(ТекущаяСтрока, 4).Value;
		НоваяСтрока.Адрес             = Лист.Cells(ТекущаяСтрока, 5).Value;      
		НоваяСтрока.ДолгVbit		  = Лист.Cells(ТекущаяСтрока, 3).Value;
		НоваяСтрока.Долг1С			  = 0;
		НоваяСтрока.Разница			  = НоваяСтрока.ДолгVbit; 
				
        ТекущаяСтрока = ТекущаяСтрока + 1;

	КонецЦикла;  
	
	Если ДатаРасчета=Неопределено Тогда
		ДатаРасчета = ТекущаяДата();
	КонецЕсли;
	
	СтрДата=Формат(ДатаРасчета, "ДФ=ггггММдд");
	Дата=ДатаРасчета;

    Книга.Close(Ложь);
    Excel.Quit();

    Excel = Неопределено;
	
    ЗаполнитьКонтрагентовПоИНН();
	
  	ПосчитатьДолги1С(Дата(СтрДата+"000000"));
КонецПроцедуры        
Процедура ЗаполнитьКонтрагентовПоИНН()

    Для Каждого СтрокаИмпорта Из ТЧДанные Цикл

        Если ПустаяСтрока(СтрокаИмпорта.ИНН) Тогда
            Продолжить;
        КонецЕсли;

        Если ЗначениеЗаполнено(СтрокаИмпорта.Контрагент) Тогда
            Продолжить;
        КонецЕсли;

        Кли = Справочники.Контрагенты.НайтиПоРеквизиту(
            "ИНН",
            СтрокаИмпорта.ИНН
        );

        Если Кли <> Неопределено Тогда
            СтрокаИмпорта.Контрагент = Кли;
        КонецЕсли;

    КонецЦикла;

КонецПроцедуры  

Процедура ПосчитатьДолги1С(ДатаРасчета)  
	
	Организация	= Пользователи.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяОрганизация");
	Если Организация.Пустая() Тогда 
		Организация = ОсновнаяОрганизация;
	КонецЕсли;            
	ВалютаРеглУчета = ВалютныйУУ_КЭ.ВалютаРегУчетаПоОрганизации(Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТиповойОстаткиИОбороты.Субконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ТиповойОстаткиИОбороты.Субконто1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ТиповойОстаткиИОбороты.Субконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ""Кассы""
		|		ИНАЧЕ ""Банковские счета""
		|	КОНЕЦ КАК КассаБанковскийСчет,
		|	ВЫБОР
		|		КОГДА ТиповойОстаткиИОбороты.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ТиповойОстаткиИОбороты.Субконто2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Договор,
		|	ЕСТЬNULL(ТиповойОстаткиИОбороты.Валюта, &ВалютаРеглУчета) КАК Валюта,
		|	ТиповойОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ТиповойОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	ТиповойОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
		|	ТиповойОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ТиповойОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт КАК СуммаНачальныйОстатокДт,
		|	ТиповойОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт КАК СуммаНачальныйОстатокКт,
		|	ТиповойОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт КАК СуммаКонечныйОстатокДт,
		|	ТиповойОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт КАК СуммаКонечныйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Типовой.ОстаткиИОбороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			Период,
		|			,
		|			Счет <> &Счет1549,
		|			,
		|			Организация = &Организация
		|				И Субконто1 ССЫЛКА Справочник.Контрагенты
		|				И Субконто1 <> &ПустойКонтрагент) КАК ТиповойОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Договор
		|ИТОГИ
		|	СУММА(СуммаНачальныйОстаток),
		|	СУММА(СуммаКонечныйОстаток),
		|	СУММА(СуммаНачальныйОстатокДт),
		|	СУММА(СуммаНачальныйОстатокКт),
		|	СУММА(СуммаКонечныйОстатокДт),
		|	СУММА(СуммаКонечныйОстатокКт)
		|ПО
		|	ОБЩИЕ,
		|	Контрагент,
		|	Валюта,
		|	Договор
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаРасчета));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаРасчета));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Счет1549", ПланыСчетов.Типовой.НДСНаАвансы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог                   
	Индекс1С = Новый Соответствие;
	
	ВыборкаКонтрагент = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		// Вставить обработку выборки ВыборкаКонтрагент
	
		ВыборкаВалюта = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаВалюта.Следующий() Цикл
			// Вставить обработку выборки ВыборкаВалюта
	
			ВыборкаДоговор = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаДоговор.Следующий() Цикл
				Если СокрЛП(ВыборкаДоговор.Договор.Наименование)="Бонус" Тогда
					Продолжить;
				КонецЕсли;
				
				ВыборкаДетальныеЗаписи = ВыборкаДоговор.Выбрать();
	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
					ИНН=ВыборкаДетальныеЗаписи.Контрагент.ИНН;
					Данные = Индекс1С[ИНН];
					Если Данные <> Неопределено Тогда
                        Данные.Сумма=Данные.Сумма + ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток; 
						Индекс1С[ИНН]=Данные;
					Иначе
						Данные = Новый Структура;
    					Данные.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
    					Данные.Вставить("Сумма",      ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток);
    					Индекс1С.Вставить(ВыборкаДетальныеЗаписи.Контрагент.ИНН, Данные);          
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;      
	
	// Вставка результатов 
	Для Каждого СтрД Из ТЧДанные Цикл  
		ИНН=СокрЛП(СтрД.ИНН);
		Данные = Индекс1С[ИНН];
        Если Данные<>Неопределено Тогда
	        СтрД.Контрагент = Данные.Контрагент;
	        СтрД.Долг1С     = Данные.Сумма;     
			СтрД.Разница	= СтрД.Разница - Данные.Сумма; 
	        Индекс1С.Удалить(ИНН);
    	КонецЕсли;
	КонецЦикла;   
	Для Каждого Элемент Из Индекс1С Цикл
	    Данные = Элемент.Значение;

	    Новая = ТЧДанные.Добавить();
	    Новая.ИНН        = Элемент.Ключ;
	    Новая.Контрагент = Данные.Контрагент;
	    Новая.Долг1С     = Данные.Сумма; 
		Новая.ДолгVbit	 = 0;
		Новая.Разница	 = -Данные.Сумма;
	КонецЦикла;
	
	СтрокиНаУдаление = Новый Массив;
	Для Каждого СтрокаТЧ Из ТЧДанные Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Контрагент) Тогда
			СтрокаТЧ.Сортировка = СтрокаТЧ.Контрагент.Наименование;
		Иначе
			СтрокаТЧ.Сортировка = "";
		КонецЕсли;
		
		Если СтрокаТЧ.Разница = 0 Тогда
			СтрокиНаУдаление.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из СтрокиНаУдаление Цикл
		ТЧДанные.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	ТЧДанные.Сортировать("Сортировка");
КонецПроцедуры

Процедура ПровестиОплаты()
	
	ВсегоСтрок = ТЧДанные.Количество();
	НомерСтроки = 0;
	
	Для Каждого Строка Из ТЧДанные Цикл
		НомерСтроки = НомерСтроки + 1;
		Если ЗначениеЗаполнено(Строка.Контрагент) И Строка.Разница < 0 Тогда
			СоздатьОплатаКонтрагента(Дата,Строка.Контрагент,Строка.Разница,"");
			Сообщить(
				Формат(НомерСтроки, "ЧГ=0") + " из " + Формат(ВсегоСтрок, "ЧГ=0") + " "
				+ Строка.Контрагент.Наименование + " - Разница: " + Строка.Разница
			);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьОплатаКонтрагента(ДатаДокумента,Контрагент,Сумма,Комментарий)        
	ДокументКасса=Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
			
	ДокументКасса.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
	Расшифровка=ДокументКасса.РасшифровкаПлатежа.Добавить();

			
	УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(ДокументКасса, глТекущийПользователь,,ДокументКасса.РасшифровкаПлатежа,"");
	//ДокументКасса.Организация=Организация;
	Касса=ДокументКасса.Организация.ОсновнаяКасса;
	ДокументКасса.Касса=Касса;
	ДокументКасса.СчетКасса=Касса.СчетУчетаБУ;
	ДокументКасса.Дата=ДатаДокумента;
	ДокументКасса.СуммаДокумента=?(Сумма<0, -Сумма, Сумма);      
	ДокументКасса.ВалютаДокумента = Касса.ВалютаДенежныхСредств;     
	ДокументКасса.Контрагент = Контрагент;
	ДокументКасса.ДоговорКонтрагента = ДокументКасса.Контрагент.ОсновнойДоговорКонтрагента;
	ДокументКасса.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду(2); // Денежные средства от реализации
	ДокументКасса.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Типовой.ДенежныеСредстваВКассеВСомах;  
			
	Расшифровка.ДоговорКонтрагента = ДокументКасса.ДоговорКонтрагента;
	Расшифровка.СуммаПлатежа = ДокументКасса.СуммаДокумента;   
	Расшифровка.КратностьВзаиморасчетов = 1;
	Расшифровка.СуммаВзаиморасчетов = ДокументКасса.СуммаДокумента;  
	Расшифровка.СтатьяДвиженияДенежныхСредств=ДокументКасса.СтатьяДвиженияДенежныхСредств;
	Расшифровка.СчетУчетаРасчетовСКонтрагентом =ПланыСчетов.Типовой.СчетаКПолучениюЗаТоварыУслуги;
	Расшифровка.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Типовой.АвансыПокупателейИЗаказчиков;
	Расшифровка.ВалютаВзаиморасчетов = ДокументКасса.ВалютаДокумента;
	
	ДокументКасса.Комментарий=Комментарий;
	ДокументКасса.Ответственный=глТекущийПользователь;
	ДокументКасса.Записать(РежимЗаписиДокумента.Проведение);
	 
 КонецПроцедуры
Версия="1.00.01";
